constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (3.22 0 0)
    (3.22 1 0)
    (0 1 0)
    (0 0 1)
    (3.22 0 1)
    (3.22 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 20 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 3 7 4)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (1 5 6 2)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (0 1 2 3)
            (3 2 6 7)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 7 6 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
